In [ ]:
#https://thecleverprogrammer.com/2022/05/14/convert-pandas-dataframe-to-numpy-array/

In [5]:
import numpy as np
import pandas as pd

data = pd.read_csv("AAPL.txt")
data.head()

         Date    Open    High     Low   Close    Volume  Adj Close
0  2008-10-14  116.26  116.40  103.14  104.08  70749800     104.08
1  2008-10-13  104.55  110.53  101.02  110.26  54967000     110.26
2  2008-10-10   85.70  100.00   85.00   96.80  79260700      96.80
3  2008-10-09   93.35   95.80   86.60   88.74  57763700      88.74
4  2008-10-08   85.91   96.33   85.68   89.79  78847900      89.79

In [6]:
data_1 = data.head()

In [7]:
np_array = np.array(data_1)
print(np_array)

[['2008-10-14' 116.26 116.4 103.14 104.08 70749800 104.08]
 ['2008-10-13' 104.55 110.53 101.02 110.26 54967000 110.26]
 ['2008-10-10' 85.7 100.0 85.0 96.8 79260700 96.8]
 ['2008-10-09' 93.35 95.8 86.6 88.74 57763700 88.74]
 ['2008-10-08' 85.91 96.33 85.68 89.79 78847900 89.79]]

If you want to select only some of the columns from a DataFrame to convert them into an array, then hereâ€™s how you can do it:

In [8]:
np_array = np.array(data_1[["Open", "Close"]])
print(np_array)

[[116.26 104.08]
 [104.55 110.26]
 [ 85.7   96.8 ]
 [ 93.35  88.74]
 [ 85.91  89.79]]